       IDENTIFICATION DIVISION.
       PROGRAM-ID. WORKER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY FIELDS.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM WORKER.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SECOND.
       PROCEDURE DIVISION.
           CALL 'WORKER'
           GOBACK.
       END PROGRAM SECOND.
